Конфигурация/Documents/АктПриемаПередачиОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
			<BasedOn>
				<xr:Item>Document.СделкаСНедвижимостью</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияСделокСНедвижимостью</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимостиПоДДУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияСделокСНедвижимостью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделокСНедвижимостью</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктПриемаПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктПриемаПередачиОбъектовНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СведенияОГосРегистрацииПраваСобственности</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СведенияОРегистрацииПраваСобственности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыОбъектовНедвижимости</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НазначениеОбъектаНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтроительствоЗавершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеЕГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетныйАктив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеАктивы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеХарактеристики</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПомещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КадастроваяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалогаНаИмущество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасчетНалогаПоКадастровойСтоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ИФНСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИФНСОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоКрупнейшимНалогоплательщикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыПлатежейВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыНачисленоУплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыДоначисленоУплаченоСамостоятельно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыДоначисленоУплаченоПоАктуПроверки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/АктПриемаПередачиОбъектовНедвижимости/Ext/ManagerModule.bsl
Функция ПодготовитьНаборПроводок(ДокументСсылка, Дата, Организация, СчетДоверительногоУправления, УчетныйРегистр, Отказ) Экспорт
	
	Движения = РегистрыБухгалтерии[УчетныйРегистр].СоздатьНаборЗаписей();
	
	Если Не (ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.АктПриемаПередачиОбъектовНедвижимости") 
			ИЛИ ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СведенияОРегистрацииПраваСобственности")) Тогда
		Возврат Движения;
	КонецЕсли;
	
	ВестиУчетНДС = РаботаСНДС.ВестиУчетНДС(Дата, Организация, СчетДоверительногоУправления);
	
	ВыделитьНДС = ВестиУчетНДС И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "НДСВключатьВСтоимость"); 
	
	ПереоцениватьПриобретенныеАктивы = БухгалтерскийУчет.ОпределитьНастройкуДляВидаУчета(Дата, Организация, СчетДоверительногоУправления, УчетныйРегистр, "ПереоцениватьПриобретенныеАктивы");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УсловияСделокСНедвижимостью.Период КАК Период,
		|	УсловияСделокСНедвижимостью.Регистратор КАК Регистратор,
		|	УсловияСделокСНедвижимостью.НомерСтроки КАК НомерСтроки,
		|	УсловияСделокСНедвижимостью.Активность КАК Активность,
		|	УсловияСделокСНедвижимостью.Организация КАК Организация,
		|	УсловияСделокСНедвижимостью.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	УсловияСделокСНедвижимостью.Основание КАК Основание,
		|	УсловияСделокСНедвижимостью.ОбъектНедвижимости КАК ОбъектНедвижимости,
		|	УсловияСделокСНедвижимостью.ПлановаяДатаПередачи КАК ПлановаяДатаПередачи,
		|	УсловияСделокСНедвижимостью.Сумма КАК Сумма,
		|	УсловияСделокСНедвижимостью.СтавкаНДС КАК СтавкаНДС,
		|	УсловияСделокСНедвижимостью.СуммаНДС КАК СуммаНДС,
		|	УсловияСделокСНедвижимостью.АктПриемаПередачи КАК АктПриемаПередачи,
		|	УсловияСделокСНедвижимостью.СведенияОГосРегистрацииПраваСобственности КАК СведенияОГосРегистрацииПраваСобственности,
		|	УсловияСделокСНедвижимостью.Отменено КАК Отменено,
		|	СделкаСНедвижимостью.ВидПраваНаНедвижимость КАК ВидПраваНаНедвижимость,
		|	СделкаСНедвижимостью.Контрагент КАК Контрагент,
		|	СделкаСНедвижимостью.Договор КАК Договор,
		|	СделкаСНедвижимостью.ВидСделки КАК ВидСделки,
		|	ЕСТЬNULL(РеквизитыОбъектовНедвижимостиСрезПоследних.УчетныйАктив, ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ДоходныеВложенияВМатериальныеЦенности)) КАК УчетныйАктив,
		|	ОбъектыНедвижимостиСпр.ВидОбъектаНедвижимости КАК ВидОбъектаНедвижимости,
		|	БухгалтерскийУчетОстаткиПереоценка.СуммаОстаток КАК Переоценка,
		|	БухгалтерскийУчетОстаткиСебестоимость.СуммаОстаток КАК Себестоимость,
		|	УсловияСделокСНедвижимостью.СведенияОГосРегистрацииПраваСобственности = ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.ПустаяСсылка)
		|			И ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.АктПриемаПередачиОбъектовНедвижимости)
		|		ИЛИ УсловияСделокСНедвижимостью.АктПриемаПередачи = ЗНАЧЕНИЕ(Документ.АктПриемаПередачиОбъектовНедвижимости.ПустаяСсылка)
		|			И ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.СведенияОРегистрацииПраваСобственности) КАК ОтразитьВыручкуПродажи,
		|	ЕСТЬNULL(ОценкиСтоимостиПрочихАктивовСрезПоследних.Стоимость, 0) КАК СтоимостьОценки,
		|	ОбъектыНедвижимостиСпр.Представление КАК ОбъектНедвижимостиПредставление
		|ИЗ
		|	РегистрСведений.УсловияСделокСНедвижимостью КАК УсловияСделокСНедвижимостью
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаСНедвижимостью КАК СделкаСНедвижимостью
		|		ПО УсловияСделокСНедвижимостью.Основание = СделкаСНедвижимостью.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыОбъектовНедвижимости.СрезПоследних(
		|				&МоментВремени,
		|				ОбъектНедвижимости В
		|					(ВЫБРАТЬ
		|						АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости
		|					ИЗ
		|						Документ.АктПриемаПередачиОбъектовНедвижимости.ОбъектыНедвижимости КАК АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости
		|					ГДЕ
		|						АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.Ссылка = &Ссылка)) КАК РеквизитыОбъектовНедвижимостиСрезПоследних
		|		ПО УсловияСделокСНедвижимостью.ОбъектНедвижимости = РеквизитыОбъектовНедвижимостиСрезПоследних.ОбъектНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЗемельныхУчастков.СрезПоследних(
		|				&МоментВремени,
		|				ОбъектНедвижимости В
		|					(ВЫБРАТЬ
		|						АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости
		|					ИЗ
		|						Документ.АктПриемаПередачиОбъектовНедвижимости.ОбъектыНедвижимости КАК АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости
		|					ГДЕ
		|						АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.Ссылка = &Ссылка)) КАК РеквизитыЗемельныхУчастковСрезПоследних
		|		ПО УсловияСделокСНедвижимостью.ОбъектНедвижимости = РеквизитыЗемельныхУчастковСрезПоследних.ОбъектНедвижимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыНедвижимости КАК ОбъектыНедвижимостиСпр
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОценкиСтоимостиПрочихАктивов.СрезПоследних(
		|					&МоментВремени,
		|					ВидАктива = ЗНАЧЕНИЕ(Перечисление.ВидыАктивов.Недвижимость)
		|						И Организация = &Организация
		|						И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|						И СубъектАналитики В
		|							(ВЫБРАТЬ
		|								АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости
		|							ИЗ
		|								Документ.АктПриемаПередачиОбъектовНедвижимости.ОбъектыНедвижимости КАК АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости
		|							ГДЕ
		|								АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.Ссылка = &Ссылка)) КАК ОценкиСтоимостиПрочихАктивовСрезПоследних
		|			ПО ОбъектыНедвижимостиСпр.Ссылка = ОценкиСтоимостиПрочихАктивовСрезПоследних.СубъектАналитики
		|				И (НАЧАЛОПЕРИОДА(ОценкиСтоимостиПрочихАктивовСрезПоследних.ДатаОкончанияДействия, ДЕНЬ) >= &Период)
		|		ПО УсловияСделокСНедвижимостью.ОбъектНедвижимости = ОбъектыНедвижимостиСпр.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|				&МоментВремени,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.ДоходныеВложенияВМатериальныеЦенностиСебестоимость), ЗНАЧЕНИЕ(ПланСчетов.Основной.КвартирыПомещенияСебестоимость)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И Субконто1 В
		|						(ВЫБРАТЬ
		|							АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости
		|						ИЗ
		|							Документ.АктПриемаПередачиОбъектовНедвижимости.ОбъектыНедвижимости КАК АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости
		|						ГДЕ
		|							АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.Ссылка = &Ссылка)) КАК БухгалтерскийУчетОстаткиСебестоимость
		|		ПО УсловияСделокСНедвижимостью.ОбъектНедвижимости = БухгалтерскийУчетОстаткиСебестоимость.Субконто1
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.БухгалтерскийУчет.Остатки(
		|				&МоментВремени,
		|				Счет В (ЗНАЧЕНИЕ(ПланСчетов.Основной.ДоходныеВложенияВМатериальныеЦенностиПереоценка), ЗНАЧЕНИЕ(ПланСчетов.Основной.КвартирыПомещенияПереоценка)),
		|				,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И Субконто1 В
		|						(ВЫБРАТЬ
		|							АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.ОбъектНедвижимости КАК ОбъектНедвижимости
		|						ИЗ
		|							Документ.АктПриемаПередачиОбъектовНедвижимости.ОбъектыНедвижимости КАК АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости
		|						ГДЕ
		|							АктПриемаПередачиОбъектовНедвижимостиОбъектыНедвижимости.Ссылка = &Ссылка)) КАК БухгалтерскийУчетОстаткиПереоценка
		|		ПО УсловияСделокСНедвижимостью.ОбъектНедвижимости = БухгалтерскийУчетОстаткиПереоценка.Субконто1
		|ГДЕ
		|	УсловияСделокСНедвижимостью.Регистратор = &Ссылка
		|	И НЕ УсловияСделокСНедвижимостью.Отменено
		|	И (УсловияСделокСНедвижимостью.СведенияОГосРегистрацииПраваСобственности = ЗНАЧЕНИЕ(Документ.СведенияОРегистрацииПраваСобственности.ПустаяСсылка)
		|				И ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.АктПриемаПередачиОбъектовНедвижимости)
		|			ИЛИ СделкаСНедвижимостью.ВидСделки = ЗНАЧЕНИЕ(Перечисление.ВидыСделок.Продажа)
		|				И ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.АктПриемаПередачиОбъектовНедвижимости)
		|			ИЛИ УсловияСделокСНедвижимостью.АктПриемаПередачи = ЗНАЧЕНИЕ(Документ.АктПриемаПередачиОбъектовНедвижимости.ПустаяСсылка)
		|				И ТИПЗНАЧЕНИЯ(&Ссылка) = ТИП(Документ.СведенияОРегистрацииПраваСобственности))";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(ДокументСсылка.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.СведенияОРегистрацииПраваСобственности") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.АктПриемаПередачиОбъектовНедвижимости.ОбъектыНедвижимости", "Документ.СведенияОРегистрацииПраваСобственности.ОбъектыНедвижимости");
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "БухгалтерскийУчет", УчетныйРегистр);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Собственность
				ИЛИ ВыборкаДетальныеЗаписи.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ Тогда
			
			Если ВыборкаДетальныеЗаписи.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Собственность Тогда
				СчетРасчетовПоСделке = ПланыСчетов.Основной.РасчетыПоСделкамСНедвижимостью;
			ИначеЕсли ВыборкаДетальныеЗаписи.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ Тогда
				СчетРасчетовПоСделке = ПланыСчетов.Основной.РасчетыСЗастройщикамиИАрендодателями;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.УчетныйАктив) Тогда 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлен учетный актив для объекта недвижимости " 
					+ ВыборкаДетальныеЗаписи.ОбъектНедвижимостиПредставление, ДокументСсылка,,, Отказ);
					Продолжить;
			КонецЕсли;
			
			НастройкиУчетаАктива = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
				Дата,
				Организация,
				СчетДоверительногоУправления,
				ВыборкаДетальныеЗаписи.УчетныйАктив,
				УчетныйРегистр);	
				
			Если ВыборкаДетальныеЗаписи.ВидСделки = Перечисления.ВидыСделок.Покупка Тогда
				
				Если ВыборкаДетальныеЗаписи.ВидОбъектаНедвижимости <> Перечисления.ВидыОбъектовНедвижимости.ЗемельныйУчасток
					И ВыборкаДетальныеЗаписи.УчетныйАктив <> Справочники.УчетныеАктивы.ТоварыКвартирыПомещения Тогда
					СчетУчета = ПланыСчетов.Основной.ВложенияВоВнеоборотныеАктивыСебестоимость;
					СчетУчетаПереоценки = ПланыСчетов.Основной.ВложенияВоВнеоборотныеАктивыПереоценка;
				Иначе	
					СчетУчета = НастройкиУчетаАктива.СчетУчета;
					СчетУчетаПереоценки = НастройкиУчетаАктива.СчетУчетаПереоценки;
				КонецЕсли;
					
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ВыборкаДетальныеЗаписи.Сумма - ВыборкаДетальныеЗаписи.СуммаНДС, "Принят объект недвижимости");
				
				// дебет
				Проводка.СчетДт = СчетУчета;
				
				Проводка.СубконтоДт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
				
				// кредит
				Проводка.СчетКт = СчетРасчетовПоСделке;
				
				Проводка.СубконтоКт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
				Проводка.СубконтоКт.Договоры = ВыборкаДетальныеЗаписи.Договор;
				
				Если ПереоцениватьПриобретенныеАктивы И ВыборкаДетальныеЗаписи.СтоимостьОценки <> 0 Тогда
					
					СуммаПереоценкиПриПокупке = ВыборкаДетальныеЗаписи.СтоимостьОценки - (ВыборкаДетальныеЗаписи.Сумма - ВыборкаДетальныеЗаписи.СуммаНДС);
					
					Если СуммаПереоценкиПриПокупке > 0 Тогда 
						
						Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СуммаПереоценкиПриПокупке, "Переоценка при покупке");
						
						Проводка.СчетДт = СчетУчетаПереоценки;
						
						Проводка.СубконтоДт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
						
						Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
						
						Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
						Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
						
					ИначеЕсли СуммаПереоценкиПриПокупке < 0 Тогда 
						
						Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, - СуммаПереоценкиПриПокупке, "Переоценка при покупке");
						
						Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
						
						Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
						Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
						
						Проводка.СчетКт = СчетУчетаПереоценки;
						
						Проводка.СубконтоКт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
						
					КонецЕсли;
					
				КонецЕсли;	
				
				Если ВыборкаДетальныеЗаписи.СуммаНДС <> 0 Тогда
					//выделим НДС
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ВыборкаДетальныеЗаписи.СуммаНДС, "Выделен НДС");
					
					// дебет
					Проводка.СчетДт = ПланыСчетов.Основной.НДСПоПриобретеннымОС;
					Проводка.СубконтоДт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
					Проводка.СубконтоДт.СчетаФактуры = ДокументСсылка;
					
					// кредит
					Проводка.СчетКт = СчетРасчетовПоСделке;
					
					Проводка.СубконтоКт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
					Проводка.СубконтоКт.Договоры = ВыборкаДетальныеЗаписи.Договор;
				КонецЕсли;

				Если Не ВыделитьНДС И ВыборкаДетальныеЗаписи.СуммаНДС <> 0 Тогда
					
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ВыборкаДетальныеЗаписи.СуммаНДС, "Выделен НДС");
					// дебет
					Проводка.СчетДт = СчетУчета;
					
					Проводка.СубконтоДт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
					
					//кредит
					Проводка.СчетКт = ПланыСчетов.Основной.НДСПоПриобретеннымОС;
					Проводка.СубконтоКт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
					Проводка.СубконтоКт.СчетаФактуры = ДокументСсылка;
					
				КонецЕсли;
				
			Иначе
				
				СуммаПереоценки = 0;
				
				Если НастройкиУчетаАктива.ПереоцениватьВДеньОперации Тогда
					
					СуммаПереоценки = ВыборкаДетальныеЗаписи.СтоимостьОценки - ВыборкаДетальныеЗаписи.Себестоимость - ВыборкаДетальныеЗаписи.Переоценка;
					
					Если СуммаПереоценки > 0 Тогда
						
						Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, СуммаПереоценки, "Переоценка объекта недвижимости перед выбытием");
						
						// дебет
						Проводка.СчетДт = НастройкиУчетаАктива.СчетУчетаПереоценки;
						
						Проводка.СубконтоДт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
						
						// кредит
						Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
						
						Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтПереоценки;
						Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
						
					ИначеЕсли СуммаПереоценки < 0 Тогда
						
						Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, -СуммаПереоценки, "Переоценка объекта недвижимости перед выбытием");
						
						// дебет
						Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
						
						Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтПереоценки;
						Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
						
						// кредит
						Проводка.СчетКт = НастройкиУчетаАктива.СчетУчетаПереоценки;
						
						Проводка.СубконтоКт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
						
					КонецЕсли;
						
				КонецЕсли;
				
				Если ВыборкаДетальныеЗаписи.ОтразитьВыручкуПродажи Тогда
					//себестоимость
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ВыборкаДетальныеЗаписи.Себестоимость, "Списание себестоимости объекта недвижимости");
					
					// дебет
					Проводка.СчетДт = ПланыСчетов.Основной.СебестоимостьПродажи;
					
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
					Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
					
					// кредит
					Проводка.СчетКт = НастройкиУчетаАктива.СчетУчета;
					
					Проводка.СубконтоКт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
					
					//переоценка
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ВыборкаДетальныеЗаписи.Переоценка + СуммаПереоценки, "Списание переоценки объекта недвижимости");
					
					// дебет
					Проводка.СчетДт = ПланыСчетов.Основной.СебестоимостьПродажи;
					
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
					Проводка.СубконтоДт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
					
					// кредит
					Проводка.СчетКт = НастройкиУчетаАктива.СчетУчетаПереоценки;
					
					Проводка.СубконтоКт.ОбъектыНедвижимости = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
					
					//выручка
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ВыборкаДетальныеЗаписи.Сумма, "Выручка");
					
					// дебет
					Проводка.СчетДт = СчетРасчетовПоСделке;
					
					Проводка.СубконтоДт.Контрагенты = ВыборкаДетальныеЗаписи.Контрагент;
					Проводка.СубконтоДт.Договоры = ВыборкаДетальныеЗаписи.Договор;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Основной.Выручка;
					
					Проводка.СубконтоКт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
					Проводка.СубконтоКт.ЦенныеБумаги = ВыборкаДетальныеЗаписи.ОбъектНедвижимости;
					
				КонецЕсли;
				
				Если ВыборкаДетальныеЗаписи.СуммаНДС > 0
					И ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.АктПриемаПередачиОбъектовНедвижимости") Тогда
					//НДС
					Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ДокументСсылка, Движения, ВыборкаДетальныеЗаписи.СуммаНДС, "НДС продажи");
					
					// дебет
					Проводка.СчетДт = ПланыСчетов.Основной.ПродажиНДС;
					
					Проводка.СубконтоДт.ПрочиеДоходыИРасходы = НастройкиУчетаАктива.АналитикаДоходовОтРеализации;
					Проводка.СубконтоДт.СтавкиНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
					
					// кредит
					Проводка.СчетКт = ПланыСчетов.Основной.НДС;
					
					Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.Инвестконтракт 
			ИЛИ ВыборкаДетальныеЗаписи.ВидПраваНаНедвижимость = Перечисления.ВидыПравНаНедвижимость.ДДУ Тогда
			СчетРасчетовПоСделке = ПланыСчетов.Основной.РасчетыСЗастройщикамиИАрендодателями;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не реализовано формирование проводок по сделке с недвижимостью (" 
				+ ВыборкаДетальныеЗаписи.ВидПраваНаНедвижимость + ", " + ВыборкаДетальныеЗаписи.ВидПраваНаНедвижимость + ")" + ДокументСсылка, 
				ДокументСсылка,,,Отказ);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен счет расчетов по сделке с недвижимостью "+ДокументСсылка, ДокументСсылка,,,Отказ);
		КонецЕсли;
		
	КонецЦикла;

	//НДС по авансам
	Основание =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Основание");
	
	РаботаСНДС.СформироватьПроводкиЗачетаНДСПоАвансам(ДокументСсылка, Движения, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Контрагент"));
	
	Возврат Движения;
	
КонецФункции

Процедура ОтразитьНДСНаРегистрахБэкОФиса(ОбъектДокумента, Отказ) Экспорт
	
	Если НЕ РаботаСНДС.ВестиУчетНДС(ОбъектДокумента.Дата, ОбъектДокумента.Организация, ОбъектДокумента.СчетДоверительногоУправления) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыСделки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОбъектДокумента.Основание,"ВидПраваНаНедвижимость, ВидСделки, Контрагент, Договор");
	Если РеквизитыСделки.ВидПраваНаНедвижимость <> Перечисления.ВидыПравНаНедвижимость.Собственность Тогда
		Возврат;
	КонецЕсли;
	
	ИФНСДляНДС = РегистрыСведений.ИФНСОрганизаций.ПолучитьИФНС(ОбъектДокумента.Дата, ОбъектДокумента.Организация, Истина);	
	Если НЕ ЗначениеЗаполнено(ИФНСДляНДС) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена ИФНС для организации по крупнейшим налогоплательщикам", ОбъектДокумента.Организация,,, Отказ);
	КонецЕсли;
	
	ВалютаРубли = ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль");
	
	СуммаНДСПоАкту = 0;
			
	Если РеквизитыСделки.ВидСделки = Перечисления.ВидыСделок.Покупка	Тогда
		
		Для Каждого ДвижениеУсловия ИЗ ОбъектДокумента.Движения.УсловияСделокСНедвижимостью Цикл
			
			СуммаНДСПоАкту = СуммаНДСПоАкту + ДвижениеУсловия.СуммаНДС;
				
			Если (ДвижениеУсловия.АктПриемаПередачи = ОбъектДокумента.Ссылка
				И ДвижениеУсловия.СведенияОГосРегистрацииПраваСобственности = Документы.СведенияОРегистрацииПраваСобственности.ПустаяСсылка()
				ИЛИ ДвижениеУсловия.СведенияОГосРегистрацииПраваСобственности = ОбъектДокумента.Ссылка
				И ДвижениеУсловия.АктПриемаПередачи = Документы.АктПриемаПередачиОбъектовНедвижимости.ПустаяСсылка())
				И НЕ ДвижениеУсловия.Отменено Тогда
				
				ДвижениеЗадолженности = ОбъектДокумента.Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
				ДвижениеЗадолженности.Период = ОбъектДокумента.Дата;
				ДвижениеЗадолженности.Организация = ОбъектДокумента.Организация;
				ДвижениеЗадолженности.СчетДоверительногоУправления = ОбъектДокумента.СчетДоверительногоУправления;
				ДвижениеЗадолженности.Основание = ОбъектДокумента.Ссылка;
				ДвижениеЗадолженности.ВидЗадолженности = Справочники.ВидыЗадолженности.НДСПоПриобретеннымЦенностям;
				ДвижениеЗадолженности.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская;
				ДвижениеЗадолженности.Аванс = Ложь;
				ДвижениеЗадолженности.Валюта = ВалютаРубли;
				ДвижениеЗадолженности.Контрагент = ИФНСДляНДС;
				ДвижениеЗадолженности.Сумма = ДвижениеУсловия.СуммаНДС;
				
				Если ОбъектДокумента.НДСВключатьВСтоимость Тогда
					
					ДвижениеЗадолженности = ОбъектДокумента.Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход();
					ДвижениеЗадолженности.Период = ОбъектДокумента.Дата;
					ДвижениеЗадолженности.Организация = ОбъектДокумента.Организация;
					ДвижениеЗадолженности.СчетДоверительногоУправления = ОбъектДокумента.СчетДоверительногоУправления;
					ДвижениеЗадолженности.Основание = ОбъектДокумента.Ссылка;
					ДвижениеЗадолженности.ВидЗадолженности = Справочники.ВидыЗадолженности.НДСПоПриобретеннымЦенностям;
					ДвижениеЗадолженности.ТипЗадолженности = Перечисления.ТипыЗадолженности.Дебиторская;
					ДвижениеЗадолженности.Аванс = Ложь;
					ДвижениеЗадолженности.Валюта = ВалютаРубли;
					ДвижениеЗадолженности.Контрагент = ИФНСДляНДС;
					ДвижениеЗадолженности.Сумма = ДвижениеУсловия.СуммаНДС;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	
	Иначе
		
		Для Каждого ДвижениеУсловия ИЗ ОбъектДокумента. Движения.УсловияСделокСНедвижимостью Цикл
			
			Если ДвижениеУсловия.АктПриемаПередачи = ОбъектДокумента.Ссылка
				И НЕ ДвижениеУсловия.Отменено Тогда
				
				ДвижениеЗадолженности = ОбъектДокумента.Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
				ДвижениеЗадолженности.Период = ОбъектДокумента.Дата;
				ДвижениеЗадолженности.Организация = ОбъектДокумента.Организация;
				ДвижениеЗадолженности.СчетДоверительногоУправления = ОбъектДокумента.СчетДоверительногоУправления;
				ДвижениеЗадолженности.Основание = ОбъектДокумента.Ссылка;
				ДвижениеЗадолженности.ВидЗадолженности = Справочники.ВидыЗадолженности.НДСТекущегоПериода;
				ДвижениеЗадолженности.ТипЗадолженности = Перечисления.ТипыЗадолженности.Кредиторская;
				ДвижениеЗадолженности.Аванс = Ложь;
				ДвижениеЗадолженности.Валюта = ВалютаРубли;
				ДвижениеЗадолженности.Контрагент = ИФНСДляНДС;
				ДвижениеЗадолженности.Сумма = ДвижениеУсловия.СуммаНДС;
				
				СуммаНДСПоАкту = СуммаНДСПоАкту + ДвижениеУсловия.СуммаНДС;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	//авансы по НДС закрывает только акт
	Если ТипЗнч(ОбъектДокумента.Ссылка) = Тип("ДокументСсылка.АктПриемаПередачиОбъектовНедвижимости") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЗадолженностиПоДенежнымСредствамОстатки.Основание КАК Основание,
			|	ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности КАК ТипЗадолженности,
			|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта КАК Валюта,
			|	ЗадолженностиПоДенежнымСредствамОстатки.Контрагент КАК Контрагент,
			|	ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток КАК СуммаОстаток
			|ИЗ
			|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
			|			&ДоДокумента,
			|			Организация = &Организация
			|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
			|				И ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоАвансам)
			|				И Основание В
			|					(ВЫБРАТЬ
			|						СчетФактура.Ссылка КАК Ссылка
			|					ИЗ
			|						Документ.СчетФактура КАК СчетФактура
			|					ГДЕ
			|						СчетФактура.Контрагент = &Контрагент
			|						И СчетФактура.Договор = &Договор
			|						И СчетФактура.Организация = &Организация
			|						И СчетФактура.СчетДоверительногоУправления = &СчетДоверительногоУправления)) КАК ЗадолженностиПоДенежнымСредствамОстатки
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗадолженностиПоДенежнымСредствамОстатки.Основание.МоментВремени";
		
		Запрос.УстановитьПараметр("Договор", РеквизитыСделки.Договор);
		Запрос.УстановитьПараметр("Контрагент", РеквизитыСделки.Контрагент);
		Запрос.УстановитьПараметр("ДоДокумента", Новый Граница(ОбъектДокумента.МоментВремени(), ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Организация", ОбъектДокумента.Организация);
		Запрос.УстановитьПараметр("СчетДоверительногоУправления", ОбъектДокумента.СчетДоверительногоУправления);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если СуммаНДСПоАкту = 0 Тогда
				Прервать;
			КонецЕсли;
			
			СуммаЗачетаНДСПоАвансам = Мин(СуммаНДСПоАкту, ВыборкаДетальныеЗаписи.СуммаОстаток);
			СуммаНДСПоАкту = СуммаНДСПоАкту - СуммаЗачетаНДСПоАвансам;
			
			Движение = ОбъектДокумента.Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьРасход();
			
			Движение.Период                       = ОбъектДокумента.Дата;
			Движение.Аванс                        = Ложь;
			Движение.Основание                    = ВыборкаДетальныеЗаписи.Основание;
			Движение.ТипЗадолженности             = ВыборкаДетальныеЗаписи.ТипЗадолженности;
			Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.НДСПоАвансам;
			Движение.Организация                  = ОбъектДокумента.Организация;
			Движение.Контрагент                   = ВыборкаДетальныеЗаписи.Контрагент;
			Движение.СчетДоверительногоУправления = ОбъектДокумента.СчетДоверительногоУправления;
			Движение.Валюта                       = ВыборкаДетальныеЗаписи.Валюта;
			Движение.Сумма                        = СуммаЗачетаНДСПоАвансам;
			
			//типа книга покупок: для аванса полученного - дебиторка, для аванса выданного - кредиторка
			Движение = ОбъектДокумента.Движения.ЗадолженностиПоДенежнымСредствам.ДобавитьПриход();
			
			Движение.Период                       = ОбъектДокумента.Дата;
			Движение.Аванс                        = Ложь;
			Движение.Основание                    = ВыборкаДетальныеЗаписи.Основание;
			Движение.ТипЗадолженности             = ВыборкаДетальныеЗаписи.ТипЗадолженности;
			Движение.ВидЗадолженности             = Справочники.ВидыЗадолженности.НДСТекущегоПериода;
			Движение.Организация                  = ОбъектДокумента.Организация;
			Движение.Контрагент                   = ИФНСДляНДС;
			Движение.СчетДоверительногоУправления = ОбъектДокумента.СчетДоверительногоУправления;
			Движение.Валюта                       = ВыборкаДетальныеЗаписи.Валюта;
			Движение.Сумма                        = СуммаЗачетаНДСПоАвансам;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
